app/controllers/favorites_controller.rb

  def create
    favorite = current_user.favorites.create(post_id: params[:post_id])
---
INSERT INTO "favorites" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 31], ["post_id", 39], ["created_at", "2021-05-29 18:04:43.801410"], ["updated_at", "2021-05-29 18:04:43.801410"]]