app/controllers/posts_controller.rb

  def show
    @favorite = current_user.favorites.find_by(post_id: @post.id)
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."post_id" = $2 LIMIT $3  [["user_id", 3], ["post_id", 1], ["LIMIT", 1]]

  def create
    @post = current_user.posts.build(post_params)

    if params[:back]
      render :new
    else
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "avatar", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "okay se compro"], ["created_at", "2021-05-29 17:50:39.869681"], ["updated_at", "2021-05-29 17:50:39.869681"], ["avatar", "blogueuse-beaute-senegalaise.png"], ["user_id", 31]]

  def update

    if @post.update(post_params)
---
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "joli fille"], ["updated_at", "2021-05-29 23:21:43.184471"], ["id", 52]]

  def destroy

    if @post.user != current_user
      flash.now[:error] = 'unauthorized access!'
      redirect_to posts_path
    else

    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 44]]